Examinator/src/Catalogs/КаталогМероприятийСУО/КаталогМероприятийСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КаталогМероприятийСУО</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.СхемыМероприятийСУО</owners>
  <attributes>
    <name>Вид</name>
    <type>
      <types>CatalogRef.ВидыМероприятийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоПроведения</name>
    <type>
      <types>EnumRef.МестаПроведенияМероприятийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипАудитории</name>
    <type>
      <types>CatalogRef.ТипыАудиторийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеОписание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШкалаОценки</name>
    <type>
      <types>CatalogRef.ШкалыОценокСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РольПреподавателя</name>
    <type>
      <types>CatalogRef.РолиПреподавателейСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДляМенеджера</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДляУчастника</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДляПреподавателя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Значимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусРазработки</name>
    <type>
      <types>EnumRef.СтатусыРазработкиОбъектовСУ</types>
    </type>
  </attributes>
  <attributes>
    <name>Продолжительность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>32</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВсеТемы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресВИнтернете</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследовательноеПрохождениеЗаданий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьПовторноеПрохождение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Темы</name>
    <attributes>
      <name>Тема</name>
      <type>
        <types>CatalogRef.СодержаниеМероприятияСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭлектронныеРесурсы</name>
    <attributes>
      <name>ЭлектронныйРесурс</name>
      <type>
        <types>CatalogRef.СводыЗнанийСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>Фрагмент</name>
      <type>
        <types>CatalogRef.СодержаниеСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПослеПрохождения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПриСтатусеЗапланировано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПриСтатусеАктивно</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПриСтатусеЗавершено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СкрыватьОтУченика</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДобавитьВБиблиотеку</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>МеткаВБиблиотеке</name>
      <type>
        <types>CatalogRef.СтруктураБиблиотекиПользователейСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Файлы</name>
    <attributes>
      <name>Файл</name>
      <type>
        <types>CatalogRef.Файлы</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПослеПрохождения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДобавитьВБиблиотеку</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>МеткаВБиблиотеке</name>
      <type>
        <types>CatalogRef.СтруктураБиблиотекиПользователейСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>СкрыватьОтУченика</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПриСтатусеЗапланировано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПриСтатусеАктивно</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПриСтатусеЗавершено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Книги</name>
    <attributes>
      <name>Книга</name>
      <type>
        <types>CatalogRef.ЛитератураСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>Фрагмент</name>
      <type>
        <types>CatalogRef.СодержаниеКнигиСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПослеПрохождения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДобавитьВБиблиотеку</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИспользуетсяПриПроведении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СкрыватьОтУченика</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>МеткаВБиблиотеке</name>
      <type>
        <types>CatalogRef.СтруктураБиблиотекиПользователейСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПриСтатусеЗапланировано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПриСтатусеАктивно</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПриСтатусеЗавершено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеПреподаватели</name>
    <attributes>
      <name>РольПреподавателя</name>
      <type>
        <types>CatalogRef.РолиПреподавателейСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>ТолькоПросмотрВедомости</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СкрыватьОтУченика</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организаторы</name>
    <comment>Заполняется в подписке УстановитьОтветственногоЭлементаСправочникаСУО</comment>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.ОрганизаторыСУО</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Catalogs/КаталогМероприятийСУО/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Вид");
	Поля.Добавить("Наименование");

КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Данные.Наименование) И ЗначениеЗаполнено(Данные.Вид) Тогда
	
		СтандартнаяОбработка = Ложь;
		
		Представление = "%1 ""%2""";
		
		Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Представление, ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Данные.Вид, "Наименование"), Данные.Наименование);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция ПреподавателюДоступенТолькоПросмотрВедомости(Мероприятие, РольПреподавателя) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Мероприятие)
		ИЛИ НЕ ЗначениеЗаполнено(РольПреподавателя) Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КаталогМероприятийСУОДополнительныеПреподаватели.РольПреподавателя
		|ИЗ
		|	Справочник.КаталогМероприятийСУО.ДополнительныеПреподаватели КАК КаталогМероприятийСУОДополнительныеПреподаватели
		|ГДЕ
		|	КаталогМероприятийСУОДополнительныеПреподаватели.РольПреподавателя = &РольПреподавателя
		|	И КаталогМероприятийСУОДополнительныеПреподаватели.ТолькоПросмотрВедомости = ИСТИНА
		|	И КаталогМероприятийСУОДополнительныеПреподаватели.Ссылка = &Мероприятие";

	Запрос.УстановитьПараметр("Мероприятие", Мероприятие);
	Запрос.УстановитьПараметр("РольПреподавателя", РольПреподавателя);

	Результат = Запрос.Выполнить();

	Если Результат.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;

КонецФункции

Функция ПреподавательСкрытОтУченика(Мероприятие, РольПреподавателя) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КаталогМероприятийСУОДополнительныеПреподаватели.РольПреподавателя
		|ИЗ
		|	Справочник.КаталогМероприятийСУО.ДополнительныеПреподаватели КАК КаталогМероприятийСУОДополнительныеПреподаватели
		|ГДЕ
		|	КаталогМероприятийСУОДополнительныеПреподаватели.РольПреподавателя = &РольПреподавателя
		|	И КаталогМероприятийСУОДополнительныеПреподаватели.СкрыватьОтУченика = ИСТИНА
		|	И КаталогМероприятийСУОДополнительныеПреподаватели.Ссылка = &Мероприятие";

	Запрос.УстановитьПараметр("Мероприятие", Мероприятие);
	Запрос.УстановитьПараметр("РольПреподавателя", РольПреподавателя);

	Результат = Запрос.Выполнить();

	Если Результат.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Функция ЕдинственныйВариантОбучения(Мероприятие) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Мероприятие) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДанныеМероприятия = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Мероприятие, Новый Структура("Общее", "Вид.Общее"));
	
	Если НЕ ДанныеМероприятия.Общее Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СхемыМероприятийСУО.Ссылка КАК ВариантОбучения
		|ИЗ
		|	Справочник.СхемыМероприятийСУО КАК СхемыМероприятийСУО
		|ГДЕ
		|	СхемыМероприятийСУО.ПометкаУдаления = ЛОЖЬ
		|	И СхемыМероприятийСУО.Мероприятие = &Мероприятие";
	
	Запрос.УстановитьПараметр("Мероприятие", Мероприятие);
	
	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() > 1 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.ВариантОбучения;
	
КонецФункции

Функция ЭтоПодчиненное(Владелец) Экспорт
	Возврат НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Владелец, "Предопределенный");
КонецФункции

// Функция возвращает продолжительность мероприятия в виде строки.
//
Функция Продолжительность(Мероприятие, СхемаПроведения = Неопределено)
	
	Если Мероприятие.Вид.Общее Тогда
		
		Если НЕ ЗначениеЗаполнено(СхемаПроведения) Тогда
			Возврат ""; // Нельзя определить продолжительность
		КонецЕсли;

		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	КаталогМероприятийСУО.Ссылка,
			|	КаталогМероприятийСУО.ПродолжительностьВСекундах
			|ИЗ
			|	Справочник.КаталогМероприятийСУО КАК КаталогМероприятийСУО
			|ГДЕ
			|	КаталогМероприятийСУО.Владелец = &СхемаПроведения
			|	И КаталогМероприятийСУО.ЭтоГруппа = ЛОЖЬ
			|	И КаталогМероприятийСУО.ПометкаУдаления = ЛОЖЬ";

		Запрос.УстановитьПараметр("СхемаПроведения", СхемаПроведения);

		Результат = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = Результат.Выбрать();

		ОбщаяПродолжительностьВСекундах = 0;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ОбщаяПродолжительностьВСекундах = ОбщаяПродолжительностьВСекундах + ВыборкаДетальныеЗаписи.ПродолжительностьВСекундах;
		КонецЦикла;
		
		Возврат ОбъектыSCORM.ПолучитьПолнуюСтрокуИзКоличестваСекунд(ОбщаяПродолжительностьВСекундах, 3);
		
	Иначе
		
		Возврат Мероприятие.Продолжительность;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти	


#КонецЕсли
